src/config/Reports/АнализСобытийИИсточниковИнформацииПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>АнализСобытийИИсточниковИнформацииПокупателей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскрашиватьГруппировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиДиаграммы</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСвойстваИКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказателиОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоказателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПоказателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользованиеПоказателя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/config/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ПродажиСебестоимость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиСебестоимость</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Регламентный документ, сформировавший движения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Comment>Документ, к которому относится данное движение</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Enums/ВидыОбъектовСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовСобытия</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеКонтактныеЛица</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Reports/АнализСобытийИИсточниковИнформацииПокупателей/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Количество строк заголовка поля табличного документа
Перем мКоличествоВыведенныхСтрокЗаголовка Экспорт;

// Настройка периода
Перем НП Экспорт;

// Структура - соответствие имен полей и их представления для построителя отчетов
Перем мСтруктураСоответствияИмен Экспорт;

// Список значений, имена отборов построителя отчета, которые существуют постоянно
Перем мСписокОтбора Экспорт;

// Макет отчета
Перем мМакет;

// Структура, ключи которой - имена отборов Построителя, значения - параметры Построителя
Перем мСтруктураДляОтбораПоКатегориям Экспорт;

// Список "взведенных" показателей отчета
Перем мПоказатели;

// Данные для построения диаграммы
Перем мДеревоДиаграммы Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура передает построителю отчета запрос
//
// Параметры
//  НЕТ
//
// Возвращаемое значение
//  НЕТ
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт

	ТекстЗапроса = "
	|ВЫБРАТЬ //РАЗЛИЧНЫЕ
	|	Событие.Ссылка                                       КАК Событие,
	|	Событие.Контрагент                                   КАК Контрагент,
	|	Событие.КонтактноеЛицо                               КАК КонтактноеЛицо,
	|	Событие.Ссылка                                       КАК КоличествоСобытий,
	|	ВЫБОР КОГДА (Событие.Контрагент ССЫЛКА Справочник.Контрагенты И Событие.Контрагент.ИсточникИнформацииПриОбращении <> &ПустойИсточник)
	|		ТОГДА Событие.Контрагент.ИсточникИнформацииПриОбращении
	|		ИНАЧЕ Событие.ИсточникИнформацииПриОбращении КОНЕЦ КАК ИсточникИнформацииПриОбращении,
	|	ПродажиКомпанииОбороты.Прибыль                       КАК Прибыль,
	|	ПродажиКомпанииОбороты.Выручка                       КАК Выручка,
	|	ПродажиКомпанииОбороты.КоличествоПроданныхТоваров    КАК КоличествоПроданныхТоваров,
	|	ПродажиКомпанииОбороты.КоличествоРасходныхДокументов КАК КоличествоРасходныхДокументов
	|{ВЫБРАТЬ
	|	Событие.Ссылка.* КАК Событие,
	|	Событие.Контрагент.* КАК Контрагент,
	|	ВЫБОР КОГДА (Событие.Контрагент ССЫЛКА Справочник.Контрагенты И Событие.Контрагент.ИсточникИнформацииПриОбращении <> &ПустойИсточник)
	|		ТОГДА Событие.Контрагент.ИсточникИнформацииПриОбращении
	|		ИНАЧЕ Событие.ИсточникИнформацииПриОбращении КОНЕЦ КАК ИсточникИнформацииПриОбращении
	|	//СВОЙСТВА
	|}
	|
	|ИЗ
	|	Документ.Событие КАК Событие
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ПродажиКомпанииОбороты.ДоговорКонтрагента.Владелец           КАК Контрагент,
	|		Сумма(ВЫБОР КОГДА ЦеныНоменклатуры.ЦенаЕдиницы ЕСТЬ NULL ТОГДА ПродажиКомпанииОбороты.СтоимостьОборот
	|					ИНАЧЕ (ПродажиКомпанииОбороты.СтоимостьОборот - ЦеныНоменклатуры.ЦенаЕдиницы * ПродажиКомпанииОбороты.КоличествоОборот)
	|			  КОНЕЦ)                                                 КАК Прибыль,
	|		Сумма(ПродажиКомпанииОбороты.СтоимостьОборот)                КАК Выручка,
	|		Сумма(ПродажиКомпанииОбороты.КоличествоОборот)               КАК КоличествоПроданныхТоваров,
	|		Количество(РАЗЛИЧНЫЕ ПродажиКомпанииОбороты.ДокументПродажи) КАК КоличествоРасходныхДокументов
	|
	|	ИЗ
	|		РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, (ДоговорКонтрагента <> &ПустойДоговор)) КАК ПродажиКомпанииОбороты
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		(
	|		ВЫБРАТЬ
	|			СебестоимостьКомпанииОбороты.Номенклатура               КАК Номенклатура,
	|			СебестоимостьКомпанииОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ВЫБОР КОГДА СебестоимостьКомпанииОбороты.КоличествоОборот = 0 ТОГДА 0
	|				  ИНАЧЕ (СебестоимостьКомпанииОбороты.СтоимостьОборот / СебестоимостьКомпанииОбороты.КоличествоОборот)
	|			КОНЕЦ                                                   КАК ЦенаЕдиницы
	|
	|		ИЗ
	|			РегистрНакопления.ПродажиСебестоимость.Обороты(&ДатаНачала, &ДатаОкончания) КАК СебестоимостьКомпанииОбороты
	|
	|		) КАК ЦеныНоменклатуры
	|
	|	ПО
	|		ЦеныНоменклатуры.Номенклатура = ПродажиКомпанииОбороты.Номенклатура
	|		И
	|		ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ПродажиКомпанииОбороты.ХарактеристикаНоменклатуры
	|
	|	СГРУППИРОВАТЬ ПО
	|		ПродажиКомпанииОбороты.ДоговорКонтрагента.Владелец
	|
	|	) КАК ПродажиКомпанииОбороты
	|
	|ПО
	|	ПродажиКомпанииОбороты.Контрагент = Событие.Контрагент
	|
	|//СОЕДИНЕНИЯ
	|
	|ГДЕ
	|	((Событие.ИсточникИнформацииПриОбращении <> &ПустойИсточник)
	|	ИЛИ
	|	(Событие.ИсточникИнформацииПриОбращении = &ПустойИсточник
	|	И ((НЕ Событие.Контрагент ССЫЛКА Справочник.Контрагенты) ИЛИ Событие.Контрагент.ИсточникИнформацииПриОбращении <> &ПустойИсточник)))
	// Обрабатываем только проведенные события с контрагентами
	|	И
	|	Событие.Проведен = Истина
	|	И
	|	Событие.ВидОбъекта = &ВидОбъектаСобытияКонтрагент
	// В отчете отображаем только покупателей или новых, не зарегистрированных контрагентов
	|	И
	|	(Событие.Контрагент.Покупатель = Истина ИЛИ НЕ Событие.Контрагент ССЫЛКА Справочник.Контрагенты)
	// Установим интервал дат запроса
	|	И
	|	((&ДатаОкончания = &ПустаяДата И &ДатаНачала = &ПустаяДата)
	|	ИЛИ
	|	((&ДатаОкончания = &ПустаяДата И &ДатаНачала <> &ПустаяДата) И Событие.Дата >= &ДатаНачала)
	|	ИЛИ
	|	((&ДатаОкончания <> &ПустаяДата И &ДатаНачала = &ПустаяДата) И Событие.Дата <= &ДатаОкончания)
	|	ИЛИ
	|	((&ДатаОкончания <> &ПустаяДата И &ДатаНачала <> &ПустаяДата) И (Событие.Дата <= &ДатаОкончания И Событие.Дата >= &ДатаНачала)))
	|
	|{ГДЕ
	|	Событие.Ссылка.*     КАК Событие,
	|	Событие.Контрагент.* КАК Контрагент,
	|	ВЫБОР КОГДА (Событие.Контрагент ССЫЛКА Справочник.Контрагенты И Событие.Контрагент.ИсточникИнформацииПриОбращении <> &ПустойИсточник)
	|		ТОГДА Событие.Контрагент.ИсточникИнформацииПриОбращении
	|		ИНАЧЕ Событие.ИсточникИнформацииПриОбращении КОНЕЦ КАК ИсточникИнформацииПриОбращении
	|	//СВОЙСТВА
	|	//КАТЕГОРИИ
	|}
	|
	|{УПОРЯДОЧИТЬ ПО
	|	Событие.Ссылка.*     КАК Событие,
	|	Событие.Контрагент.* КАК Контрагент,
	|	ВЫБОР КОГДА (Событие.Контрагент ССЫЛКА Справочник.Контрагенты И Событие.Контрагент.ИсточникИнформацииПриОбращении <> &ПустойИсточник)
	|		ТОГДА Событие.Контрагент.ИсточникИнформацииПриОбращении
	|		ИНАЧЕ Событие.ИсточникИнформацииПриОбращении КОНЕЦ КАК ИсточникИнформацииПриОбращении
	|	//СВОЙСТВА
	|}
	|
	|ИТОГИ КОЛИЧЕСТВО(КоличествоСобытий) ПО ОБЩИЕ
	|	ИсточникИнформацииПриОбращении
	|{
	|ИТОГИ ПО
	|	Событие.Ссылка.*     КАК Событие,
	|	Событие.Контрагент.* КАК Контрагент,
	|	ВЫБОР КОГДА (Событие.Контрагент ССЫЛКА Справочник.Контрагенты И Событие.Контрагент.ИсточникИнформацииПриОбращении <> &ПустойИсточник)
	|		ТОГДА Событие.Контрагент.ИсточникИнформацииПриОбращении
	|		ИНАЧЕ Событие.ИсточникИнформацииПриОбращении КОНЕЦ КАК ИсточникИнформацииПриОбращении
	|	//СВОЙСТВА
	|}
	|";
	
	мСтруктураСоответствияИмен.Очистить();
	мСтруктураСоответствияИмен = Новый Структура("Контрагент, КонтактноеЛицо, Событие, ИсточникИнформацииПриОбращении, ДокументПродажи", "Контрагент", "Контактное лицо события", "Событие", "Источник информации при обращении покупателя", "Документ продажи");
	
	мСоответствиеНазначений = Новый Соответствие;

	Если ИспользоватьСвойстваИКатегории Тогда
		
		ТаблицаПолей = Новый ТаблицаЗначений;
		ТаблицаПолей.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляются свойства и категории. Используется в условии соединения с регистром сведений, хранящим значения свойств или категорий
		ТаблицаПолей.Колонки.Добавить("Представление");// представление поля, для которого добавляются свойства и категории. 
		ТаблицаПолей.Колонки.Добавить("Назначение");   // назначение свойств/категорий объектов для данного поля
		ТаблицаПолей.Колонки.Добавить("ТипЗначения");  // тип значения поля, для которого добавляются свойства и категории. Используется, если не установлено назначение
		ТаблицаПолей.Колонки.Добавить("НетКатегорий"); // признак НЕиспользования категорий для объекта

		НоваяСтрока = ТаблицаПолей.Добавить();
		НоваяСтрока.ПутьКДанным = "Событие.Контрагент";
		НоваяСтрока.Представление = "Контрагент";
		НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты;

		НоваяСтрока = ТаблицаПолей.Добавить();
		НоваяСтрока.ПутьКДанным = "Событие.КонтактноеЛицо";
		НоваяСтрока.Представление = "Контактное лицо";
		НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_КонтактныеЛица;

		ТекстПоляКатегорий = "";
		ТекстПоляСвойств = "";

		// Добавим строки запроса, необходимые для использования свойств и категорий
		ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, мСтруктураСоответствияИмен, мСоответствиеНазначений, ПостроительОтчета.Параметры, , ТекстПоляКатегорий, ТекстПоляСвойств, , , , , , мСтруктураДляОтбораПоКатегориям);

	КонецЕсли;
	
	ПостроительОтчета.Текст = ТекстЗапроса;
	
	Если ИспользоватьСвойстваИКатегории Тогда
		УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, мСоответствиеНазначений, мСтруктураСоответствияИмен);
	КонецЕсли;
	
	ЗаполнитьПредставленияПолей(мСтруктураСоответствияИмен, ПостроительОтчета);
	
	Для каждого ЭлементСписка Из мСписокОтбора Цикл
		Если ПостроительОтчета.Отбор.Найти(ЭлементСписка.Значение) = Неопределено Тогда
			ПостроительОтчета.Отбор.Добавить(ЭлементСписка.Значение);
		КонецЕсли; 
	КонецЦикла;
	
	ПостроительОтчета.ИзмеренияСтроки.Добавить("ИсточникИнформацииПриОбращении");
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Контрагент");
	
КонецПроцедуры

// Функция формирует строку представления периода отчета
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   Строка
//
Функция СформироватьСтрокуПериода() Экспорт

	ОписаниеПериода = "";
	
	// Вывод заголовка, описателя периода и фильтров и заголовка
	Если ДатаНачала = '00010101000000' И ДатаОкончания = '00010101000000' Тогда

		ОписаниеПериода     = "Период не установлен";

	Иначе

		Если ДатаНачала = '00010101000000' ИЛИ ДатаОкончания = '00010101000000' Тогда

			ОписаниеПериода = "Период: " + Формат(ДатаНачала, "ДФ = ""дд.ММ.гггг""; ДП = ""...""") 
							+ " - "      + Формат(ДатаОкончания, "ДФ = ""дд.ММ.гггг""; ДП = ""...""");

		Иначе

			Если ДатаНачала <= ДатаОкончания Тогда
				ОписаниеПериода = "Период: " + ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания), "ФП = Истина");
			Иначе
				ОписаниеПериода = "Неправильно задан период!"
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Возврат ОписаниеПериода;
	
КонецФункции // ()

// Процедура меняет видимость заголовка поля табличного документа
// 
// Параметры
//  Таб - табличный документ
//
// Возвращаемые значения
//  НЕТ
Процедура ИзменитьВидимостьЗаголовка(Таб) Экспорт

	ОбластьВидимости = Таб.Область(1,,мКоличествоВыведенныхСтрокЗаголовка,);
	ОбластьВидимости.Видимость = ПоказыватьЗаголовок;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА

// Процедура заполняет ПолеТабличногоДокумента
//
// Параметры - Таб - ПолеТабличногоДокумента
Процедура СформироватьОтчет(Таб) Экспорт

	// Показатели
	мПоказатели.Очистить();
	Для каждого Строки Из ПоказателиОтчета Цикл
		Если Строки.ИспользованиеПоказателя Тогда
			мПоказатели.Добавить(Строки.ИмяПоказателя, Строки.ПредставлениеПоказателя);
		КонецЕсли; 
	КонецЦикла;
	
	ПостроительОтчета.Параметры.Вставить("ПустаяДата"                 , '00010101000000');
	ПостроительОтчета.Параметры.Вставить("ДатаНачала"                 , НачалоДня(ДатаНачала));
	ПостроительОтчета.Параметры.Вставить("ДатаОкончания"              , ?(ДатаОкончания = '00010101000000', ДатаОкончания, КонецДня(ДатаОкончания)));
	ПостроительОтчета.Параметры.Вставить("ПустойКонтрагент"           , Справочники.Контрагенты.ПустаяСсылка());
	ПостроительОтчета.Параметры.Вставить("ПустойИсточник"             , Справочники.ИсточникиИнформацииПриОбращенииПокупателей.ПустаяСсылка());
	ПостроительОтчета.Параметры.Вставить("ПустойДоговор"              , Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	ПостроительОтчета.Параметры.Вставить("ВидОбъектаСобытияКонтрагент", Перечисления.ВидыОбъектовСобытия.Контрагент);

	Если НЕ ЗадатьПараметрыОтбораПоКатегориям(ПостроительОтчета, мСтруктураДляОтбораПоКатегориям) Тогда
		Предупреждение("По одной категории нельзя устанавливать несколько отборов");
		Возврат;
	КонецЕсли;

	мКоличествоВыведенныхСтрокЗаголовка = 0;
	
	ПостроительОтчета.Выполнить();

	Таб.Очистить();

	Секция = мМакет.ПолучитьОбласть("ШапкаВерх|ОсновнаяКолонка");
	Таб.Вывести(Секция);
	Таб.Область(1, 2, 3, (?(мПоказатели.Количество()>2, 2, мПоказатели.Количество())*2 + 2)).ПоВыделеннымКолонкам = Истина;

	Секция = мМакет.ПолучитьОбласть("ШапкаИнтервал|ОсновнаяКолонка");
	Секция.Параметры.СтрокаИнтервал = СформироватьСтрокуПериода();
	Таб.Вывести(Секция);
	Таб.Область(4, 2, 4, (мПоказатели.Количество()*2 + 2)).ПоВыделеннымКолонкам = Истина;
	мКоличествоВыведенныхСтрокЗаголовка = 4;
	
	СтрокаГруппировок = СформироватьСтрокуИзмерений(ПостроительОтчета.ИзмеренияСтроки);
	Если НЕ ПустаяСтрока(СтрокаГруппировок) Тогда
		СтрокаГруппировок = "Группировки строк: " + СтрокаГруппировок;
		Секция = мМакет.ПолучитьОбласть("ШапкаГруппировки|ОсновнаяКолонка");
		Секция.Параметры.СтрокаГруппировок = СтрокаГруппировок;
		Таб.Вывести(Секция);
		Таб.Область((мКоличествоВыведенныхСтрокЗаголовка + 1), 2, (мКоличествоВыведенныхСтрокЗаголовка + 1), (мПоказатели.Количество()*2 + 2)).ПоВыделеннымКолонкам = Истина;
		мКоличествоВыведенныхСтрокЗаголовка = мКоличествоВыведенныхСтрокЗаголовка + 1;
	КонецЕсли; 

	СтрокаОтборов = СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);
	Если НЕ ПустаяСтрока(СтрокаОтборов) Тогда
		СтрокаОтборов = "Отбор: " + СтрокаОтборов;
		Секция = мМакет.ПолучитьОбласть("ШапкаОтбор|ОсновнаяКолонка");
		Секция.Параметры.СтрокаОтборов = СтрокаОтборов;
		Таб.Вывести(Секция);
		Таб.Область((мКоличествоВыведенныхСтрокЗаголовка + 1), 2, (мКоличествоВыведенныхСтрокЗаголовка + 1), (мПоказатели.Количество()*2 + 2)).ПоВыделеннымКолонкам = Истина;
		мКоличествоВыведенныхСтрокЗаголовка = мКоличествоВыведенныхСтрокЗаголовка + 1;
	КонецЕсли; 
	
	СтрокаПорядка = СформироватьСтрокуПорядка(ПостроительОтчета.Порядок);
	Если НЕ ПустаяСтрока(СтрокаПорядка) Тогда
		СтрокаПорядка = "Сортировка: " + СтрокаПорядка;
		Секция = мМакет.ПолучитьОбласть("ШапкаПорядок|ОсновнаяКолонка");
		Секция.Параметры.СтрокаПорядка = СтрокаПорядка;
		Таб.Вывести(Секция);
		Таб.Область((мКоличествоВыведенныхСтрокЗаголовка + 1), 2, (мКоличествоВыведенныхСтрокЗаголовка + 1), (мПоказатели.Количество()*2 + 2)).ПоВыделеннымКолонкам = Истина;
		мКоличествоВыведенныхСтрокЗаголовка = мКоличествоВыведенныхСтрокЗаголовка + 1;
	КонецЕсли;
	
	Секция = мМакет.ПолучитьОбласть("ШапкаТаблицы|ОсновнаяКолонка");
	Таб.Вывести(Секция);
	
	ДеревоДиаграммы = Новый ДеревоЗначений;
	ДеревоДиаграммы.Колонки.Добавить("Группировка");
	ДеревоДиаграммы.Колонки.Добавить("ИмяГруппировки");
	
	СтруктураПоказателей = Новый Структура;
	
	Для каждого Строки Из мПоказатели Цикл

		ДеревоДиаграммы.Колонки.Добавить(Строки.Значение);
		
		Секция = мМакет.ПолучитьОбласть("ШапкаТаблицы|КолонкаПоказателя");
		Секция.Параметры.НаименованиеПоказателя = Строки.Представление;
		Таб.Присоединить(Секция);
		
		СуммаПоказателя = 0;

		ВыборкаДокументов = ПостроительОтчета.Результат.Выбрать();
		Если Строки.Значение = "КоличествоСобытий" Тогда
			Если ВыборкаДокументов.Следующий() Тогда
				СуммаПоказателя = СуммаПоказателя + ?(ВыборкаДокументов[Строки.Значение] = NULL, 0, ВыборкаДокументов[Строки.Значение]);
			КонецЕсли;
		Иначе
			Пока ВыборкаДокументов.Следующий() Цикл
				Если ВыборкаДокументов.ТипЗаписи() = ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
					СуммаПоказателя = СуммаПоказателя + ?(ВыборкаДокументов[Строки.Значение] = NULL, 0, ВыборкаДокументов[Строки.Значение]);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		
		СтруктураПоказателей.Вставить(Строки.Значение, СуммаПоказателя);

	КонецЦикла; 
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	РезультатЗапроса = ПостроительОтчета.Результат;
	
	ВывестиСтроки(Таб, мМакет, РезультатЗапроса, 0, СтруктураПоказателей, ДеревоДиаграммы.Строки);

	мДеревоДиаграммы = ДеревоДиаграммы;

	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	ИзменитьВидимостьЗаголовка(Таб);
	
	Таб.Показать();
	
КонецПроцедуры

// Процедура выводит строки в ПолеТабличногоДокумента
// 
// Параметры
//  Таб - ПолеТабличногоДокумента
//  Макет - макет отчета
//  ТекущаяВыборка - выборка запроса, из которой выводить строки
//  МассивГруппировок - массив с именами группировок
//  ИндексТекущейГруппировки - число, индекс выводимой группировки
// 
// Возвращаемое значение
//  НЕТ
Процедура ВывестиСтроки(Таб, Макет, ТекущаяВыборка, ИндексТекущейГруппировки, ПоказателиПрошлойГруппировки, СтрокиДереваДиаграммы)

	Если ИндексТекущейГруппировки > ПостроительОтчета.ИзмеренияСтроки.Количество()-1 Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеГруппировки = ПостроительОтчета.ИзмеренияСтроки[ИндексТекущейГруппировки].Имя;

	// Если добавить в группировки строк одинаковые значения, то в именах групировок
	// добавляется цифра 1,2,3..., а поля таблицы запроса естественно не добавляются с такими именами
	// поэтому из имени группировки удилим последние цифры в имени
	
	а = СтрДлина(НаименованиеГруппировки);
	Пока а > 0 Цикл
		Если КодСимвола(Сред(НаименованиеГруппировки, а, 1)) >= 49 И КодСимвола(Сред(НаименованиеГруппировки, а, 1)) <= 57 Тогда
			а = а - 1;
			Продолжить;
		КонецЕсли;
		Прервать;
	КонецЦикла;
	
	НаименованиеГруппировки = Лев(НаименованиеГруппировки, а);
	
	СтруктураПоказателей = Новый Структура;
	
	Выборка = ТекущаяВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, НаименованиеГруппировки);
	
	Пока Выборка.Следующий() Цикл

		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
			Продолжить;
		КонецЕсли; 

		ТекущийЦвет = Новый Цвет;
		Если РаскрашиватьГруппировки Тогда
			Если ИндексТекущейГруппировки <> ПостроительОтчета.ИзмеренияСтроки.Количество()-1 Тогда
				ИндексЦвета = ИндексТекущейГруппировки;
				Если ИндексЦвета >= 10 Тогда
					ИндексЦвета = (ИндексТекущейГруппировки/10 - Цел(ИндексТекущейГруппировки/10))*10;
				КонецЕсли; 
				ТекущийЦвет = Макет.Области["Цвет"+СокрЛП(Строка(ИндексЦвета))].ЦветФона;
			Иначе
				ТекущийЦвет = Новый Цвет;
			КонецЕсли; 
		КонецЕсли;
			
		СтрокаВывода = СокрЛП(Строка(Выборка[НаименованиеГруппировки]));
		Если ПустаяСтрока(СтрокаВывода) Тогда
			СтрокаВывода = "<...>";
		КонецЕсли;

		Секция = Макет.ПолучитьОбласть("СтрокаГруппировки|ОсновнаяКолонка");
		Секция.Параметры.ЗначениеГруппировки = СтрокаВывода;
		Секция.Области.ЗначениеГруппировки.Отступ = ИндексТекущейГруппировки;
		Секция.Области.ЗначениеГруппировки.Расшифровка = Выборка[НаименованиеГруппировки];
		Если НаименованиеГруппировки = "Контрагент" И ТипЗнч(Выборка[НаименованиеГруппировки]) = Тип("Строка") Тогда
			Секция.Области.ЗначениеГруппировки.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
		КонецЕсли; 
		Если РаскрашиватьГруппировки Тогда
			Секция.Области.ЗначениеГруппировки.ЦветФона = ТекущийЦвет;
		КонецЕсли;
		Таб.Вывести(Секция, ИндексТекущейГруппировки);
		
		СтрокаДереваДиаграммы = СтрокиДереваДиаграммы.Добавить();
		СтрокаДереваДиаграммы.Группировка    = Выборка[НаименованиеГруппировки];
		СтрокаДереваДиаграммы.ИмяГруппировки = НаименованиеГруппировки;

		Для каждого Строки Из мПоказатели Цикл

			СуммаПоказателя = 0;

			Если Найти(НаименованиеГруппировки, "Событие") = 0 Тогда
			
				Если Строки.Значение = "КоличествоСобытий" Тогда
					СуммаПоказателя = СуммаПоказателя + ?(Выборка[Строки.Значение] = NULL, 0, Выборка[Строки.Значение]);
				Иначе
					ВыборкаДокументов = Выборка.Выбрать();
					Пока ВыборкаДокументов.Следующий() Цикл
						Если ВыборкаДокументов.ТипЗаписи() = ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
							СуммаПоказателя = СуммаПоказателя + ?(ВыборкаДокументов[Строки.Значение] = NULL, 0, ВыборкаДокументов[Строки.Значение]);
						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли;
			
			КонецЕсли; 
			
			СтруктураПоказателей.Вставить(Строки.Значение, СуммаПоказателя);
			
			ДействительнаяСуммаПоказателяПрошлойГруппировки = 0;
			ПоказателиПрошлойГруппировки.Свойство(Строки.Значение, ДействительнаяСуммаПоказателяПрошлойГруппировки);
			
			ПроцентПоказателя = "" + (?(ДействительнаяСуммаПоказателяПрошлойГруппировки = 0, 0, (Окр((СуммаПоказателя/ДействительнаяСуммаПоказателяПрошлойГруппировки*100),2))));
			
			Секция = Макет.ПолучитьОбласть("СтрокаГруппировки|КолонкаПоказателя");
			Секция.Параметры.СуммаПоказателя = Формат(СуммаПоказателя, "ЧЦ=20; ЧДЦ=2; ЧРД=,");
			Секция.Параметры.ПроцентПоказателя = Формат(ПроцентПоказателя, "ЧЦ=5; ЧДЦ=2; ЧРД=,") + " %";
			Если РаскрашиватьГруппировки Тогда
				Секция.Области.ЗначенияПоказателя.ЦветФона = ТекущийЦвет;
			КонецЕсли;
			Если НаименованиеГруппировки = "Контрагент" Тогда
				СтруктураРасшифровки = Новый Структура("Контрагент", Выборка[НаименованиеГруппировки]);
				Секция.Области.ЗначенияПоказателя.Расшифровка = СтруктураРасшифровки;
			КонецЕсли; 
			Таб.Присоединить(Секция, ИндексТекущейГруппировки);
			
			СтрокаДереваДиаграммы[Строки.Значение] = СуммаПоказателя;
			
		КонецЦикла;
		
		ВывестиСтроки(Таб, Макет, Выборка, ИндексТекущейГруппировки+1, СтруктураПоказателей, СтрокаДереваДиаграммы.Строки);
		
	КонецЦикла; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

мВалютаУпрУчета = Константы.ВалютаУправленческогоУчета.Получить();

СтрокаПоказателя = ПоказателиОтчета.Добавить();
СтрокаПоказателя.ИмяПоказателя = "Выручка";
СтрокаПоказателя.ПредставлениеПоказателя  = "Сумма выручки в " + СокрЛП(мВалютаУпрУчета.Наименование);
СтрокаПоказателя = ПоказателиОтчета.Добавить();
СтрокаПоказателя.ИмяПоказателя = "Прибыль";
СтрокаПоказателя.ПредставлениеПоказателя = "Сумма прибыли в " + СокрЛП(мВалютаУпрУчета.Наименование);
СтрокаПоказателя = ПоказателиОтчета.Добавить();
СтрокаПоказателя.ИмяПоказателя = "КоличествоРасходныхДокументов";
СтрокаПоказателя.ПредставлениеПоказателя = "Количество продаж";
СтрокаПоказателя = ПоказателиОтчета.Добавить();
СтрокаПоказателя.ИмяПоказателя = "КоличествоПроданныхТоваров";
СтрокаПоказателя.ПредставлениеПоказателя = "Количество проданных товаров";
СтрокаПоказателя = ПоказателиОтчета.Добавить();
СтрокаПоказателя.ИмяПоказателя = "КоличествоСобытий";
СтрокаПоказателя.ПредставлениеПоказателя = "Количество событий";

мМакет = ПолучитьМакет("Макет");

мКоличествоВыведенныхСтрокЗаголовка = 0;

// Установим имены быстрых отборов
мСписокОтбора = Новый СписокЗначений;
мСписокОтбора.Добавить("Контрагент");
мСписокОтбора.Добавить("ИсточникИнформацииПриОбращении");

НП = Новый НастройкаПериода;

мСтруктураСоответствияИмен = Новый Структура;

мПоказатели = Новый СписокЗначений;
